FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_interFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          45;
        startFace       5457;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          45;
        startFace       5502;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          33;
        startFace       5547;
    }
    upperWall
    {
        type            patch;
        nFaces          63;
        startFace       5580;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       5643;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          5580;
        startFace       5703;
    }
)

// ************************************************************************* //
