FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_interFoam/0_orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            noSlip;;
        //value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    upperWall
    {
        type            noSlip;
    }
    lowerWall
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
